<a href="https://colab.research.google.com/github/daje0601/Python-2020/blob/master/pnadas_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 3. data 다루기

### 이번 data다루기에서는 다양한 방법으로 df를 변형하는 방법에 대해 배워보겠습니다. 


##1)   통계를 이용한 분석 : 평균, 중간값, 상관 관계 등을 분석하여 인사이트를 얻는 것 

##2)   슬라이싱을 통한 분석 : 다양한 방법으로 데이터를 슬라이싱하여 분석하기 편하게 df를 조작하는 것 

##3)   EDA : df를 다양한 관점에서 살펴보고 탐색하면서 인사이트를 얻는 것

큰 흐름을 놓칠 수 있기에 이쯤 다시 리마인드를 해보도록 하겠습니다.   
우리는 지금 datascience가 되기 위해 가장 기초적인 pandas라는 python 라이브러리를 배우고 있습니다.  
  
그 중에서도   
  
    
    [완료] 파일불러오기(내부 / 외부)  
    ↓  
    [완료] column&row 큰 틀에서 다루기  
    ↓  
    [완료] 불러온 파일 여러개를 합쳐보는 방법  
    ↓    
    [진행중] column&row 큰 틀에서 다루기(본 강의)
    ↓  
    [진행 예정] 결측치 다루기  
    ↓   
    [진행 예정] 데이터 시각화  
    
  위와 같이 공부를 진행할 예정입니다.

## 1) 통계를 이용한 분석

In [1]:
# 자~ 데이터를 불러와볼게요. 저희는 실습동안 최대한 1개의 df로 실습을 진행해보려 합니다. 참고해주세요
import pandas as pd 
import numpy as np

!pandas read csv form github

#[url로 외부에서 데이터 가져오기]
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/car_crashes.csv"
df = pd.read_csv(url)


# 데이터 줄이는 코드 : 데이터가 크기 때문에 줄여서 실습함 
df = df.set_index("abbrev")
df = df.iloc[0:5, 0:5]
df

/bin/bash: pandas: command not found

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       18.8     7.332    5.640          18.048       15.040
AK       18.1     7.421    4.525          16.290       17.014
AZ       18.6     6.510    5.208          15.624       17.856
AR       22.4     4.032    5.824          21.056       21.280
CA       12.0     4.200    3.360          10.920       10.680

In [2]:
# 당연히 df가 잘 출력되었는지 확인해야겠죠?
df.head()

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       18.8     7.332    5.640          18.048       15.040
AK       18.1     7.421    4.525          16.290       17.014
AZ       18.6     6.510    5.208          15.624       17.856
AR       22.4     4.032    5.824          21.056       21.280
CA       12.0     4.200    3.360          10.920       10.680

In [3]:
# info라는 명령어를 이용하면 해당 데이터에 어떤 정보들이 있는지 간략하게 보여준다. 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, AL to CA
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   total           5 non-null      float64
 1   speeding        5 non-null      float64
 2   alcohol         5 non-null      float64
 3   not_distracted  5 non-null      float64
 4   no_previous     5 non-null      float64
dtypes: float64(5)
memory usage: 240.0+ bytes

In [4]:
# describe라는 명령어를 입력하면 number(int, float)에 한하여 통계적인 분석표를 일괄적으로 얻을 수 있다.
df.describe()

           total  speeding   alcohol  not_distracted  no_previous
count   5.000000  5.000000  5.000000        5.000000     5.000000
mean   17.980000  5.899000  4.911400       16.387600    16.374000
std     3.753931  1.667002  1.000976        3.709385     3.901152
min    12.000000  4.032000  3.360000       10.920000    10.680000
25%    18.100000  4.200000  4.525000       15.624000    15.040000
50%    18.600000  6.510000  5.208000       16.290000    17.014000
75%    18.800000  7.332000  5.640000       18.048000    17.856000
max    22.400000  7.421000  5.824000       21.056000    21.280000

In [5]:
# 아래와 같이 코드를 작성하면 column "total" 어떤 데이터가 몇개가 있는지 확인 가능하다

df["total"].value_counts().head()

# 이는 문자열 카운트도 가능하다 
df["speeding"].value_counts().head()

6.510    1
4.032    1
7.421    1
4.200    1
7.332    1
Name: speeding, dtype: int64

## 2) 슬라이싱을 통한 분석

In [6]:
# sort_values() 명령어를 이용하여 데이터가 큰 순서대로 정렬(ascending=False)할 수 있다 
# 내림차순으로 정렬하려면 ascending=True를 쓰면 된다. 

df.sort_values(by="total", ascending=False, inplace=False).head()

# inplace=False가 무엇인지 앞에서 배웠다. 모르면 되돌아가서 다시 공부를 꼭 하고 오시길..!
# 중간 중간 .head()를 쓰는 이유는 데이터는 확인을 해야하는데, 다 출력되는게 보기 불편해서 쓰는겁니다.

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AR       22.4     4.032    5.824          21.056       21.280
AL       18.8     7.332    5.640          18.048       15.040
AZ       18.6     6.510    5.208          15.624       17.856
AK       18.1     7.421    4.525          16.290       17.014
CA       12.0     4.200    3.360          10.920       10.680

#### 2-1) value 1개 선택하기

In [7]:
# 방법 1
df.loc["CA", "total"]

12.0

In [8]:
# 방법 2
df.iloc[4, 0]

12.0

### 2-2) index(row) 받아오기

In [9]:
# 기본적으로 아래와 같이 써주는게 인덱스의 기본입니다. 
# 방법1 
df.loc["AR", :]

total             22.400
speeding           4.032
alcohol            5.824
not_distracted    21.056
no_previous       21.280
Name: AR, dtype: float64

In [10]:
# 그런데 저렇게 다 쓰기가 귀찮죠? 그래서 뺄 수는 건 빼서 씁니다. 
# 방법2
df.loc["AR"]

total             22.400
speeding           4.032
alcohol            5.824
not_distracted    21.056
no_previous       21.280
Name: AR, dtype: float64

In [11]:
# 그래도 귀찮고 데이터가 많아지면 column이름을 일일이 찾기 힘들어서 iloc를 이용하여 슬라이싱을 진행한다.
# 방법3
df.iloc[0] # 뒤쪽 콜론을 생략하여 사용할 수 있습니다.

total             18.800
speeding           7.332
alcohol            5.640
not_distracted    18.048
no_previous       15.040
Name: AL, dtype: float64

In [12]:
# 연속된 row 받아오기
# 방법4
df.loc[:"CA"]

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       18.8     7.332    5.640          18.048       15.040
AK       18.1     7.421    4.525          16.290       17.014
AZ       18.6     6.510    5.208          15.624       17.856
AR       22.4     4.032    5.824          21.056       21.280
CA       12.0     4.200    3.360          10.920       10.680

In [13]:
# 연속되지 않는 row 받아오기 
# 방법5
df.loc[["AR", "CA", "AK"]]

# 여기서 포인트는 []를 두번쓰는 것이다! 
# 잊기 쉬운 정보이니 잘 기억해둘것!! 리스트에 넣어준다고 생각해야함

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AR       22.4     4.032    5.824          21.056       21.280
CA       12.0     4.200    3.360          10.920       10.680
AK       18.1     7.421    4.525          16.290       17.014

### 2-3) column 받아오기

In [14]:
#coloumn값 받아오기 
#방법1
df.loc[:, "alcohol"]

abbrev
AL    5.640
AK    4.525
AZ    5.208
AR    5.824
CA    3.360
Name: alcohol, dtype: float64

In [15]:
#방법2 
df["alcohol"]

abbrev
AL    5.640
AK    4.525
AZ    5.208
AR    5.824
CA    3.360
Name: alcohol, dtype: float64

In [16]:
# 연속된 컬럼 받아오기
#방법3
df.iloc[:, 3:5]

        not_distracted  no_previous
abbrev
AL              18.048       15.040
AK              16.290       17.014
AZ              15.624       17.856
AR              21.056       21.280
CA              10.920       10.680

In [17]:
# 연속되지 않은 여러 개의 clumn 받아오기 

df[["total", "alcohol"]]

# 여기서 포인트는 []를 두번쓰는 것이다! 
# 잊기 쉬운 정보이니 잘 기억해둘것!! 리스트에 넣어준다고 생각해야함

        total  alcohol
abbrev
AL       18.8    5.640
AK       18.1    4.525
AZ       18.6    5.208
AR       22.4    5.824
CA       12.0    3.360

### 2-4) Boolean으로 data 분류하기

In [18]:
# cloumn "total"에서 18이 넘는 값을 data라는 변수에 넣어주세요 라는 말입니다. 
data = df["total"] > 18
data

abbrev
AL     True
AK     True
AZ     True
AR     True
CA    False
Name: total, dtype: bool

In [19]:
# 변수 data를 아래와 같이 넣어주어 true 값만 출력할 수 있다. 
df.loc[data]

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       18.8     7.332    5.640          18.048       15.040
AK       18.1     7.421    4.525          16.290       17.014
AZ       18.6     6.510    5.208          15.624       17.856
AR       22.4     4.032    5.824          21.056       21.280

In [20]:
data1 = df["total"] == 18.8
data1

abbrev
AL     True
AK    False
AZ    False
AR    False
CA    False
Name: total, dtype: bool

In [21]:
# 위와 같이 data1을 아래와 같이 적어주면 해당되는 값만 출력이 된다. 
df.loc[data1]

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       18.8     7.332     5.64          18.048        15.04

In [22]:
# 위의 조건을 &(and)와 |(or)을 이용하여 합질 수도 있고, 이를 변수에 넣어 위와 같이 원하는 데이터를 출력할 수도 있다
condition = data & data1
df.loc[condition]

# 18.8에 해당되는 데이터는 AL 밖에 없으므로 아래와 같이 출력된다

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       18.8     7.332     5.64          18.048        15.04

### 2-5) 데이터 값 변경

In [23]:
# 18.8을 10으로 변경해보자!
# 지금 이 블로그를 쭉~ 실습해서 오고 있으신 분들은 정말 대단합니다. 
# 중간중간 휴식을 꼭 가지시고, 다시 한번 집중을 해보죠 사실 지금부터가 진짜입니다. 

# 방법1 : 데이터 딱 1개만 바꾸는 방법 
df.loc["AL", "total"] = 10
df

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       10.0     7.332    5.640          18.048       15.040
AK       18.1     7.421    4.525          16.290       17.014
AZ       18.6     6.510    5.208          15.624       17.856
AR       22.4     4.032    5.824          21.056       21.280
CA       12.0     4.200    3.360          10.920       10.680

In [24]:
# 방법2 : 열의 모든 값을 동일한 값으로 변경하는 방법 
df["total"] = 1000
df

# row는 확인해보세요. 어렵지 않습니다.

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       1000     7.332    5.640          18.048       15.040
AK       1000     7.421    4.525          16.290       17.014
AZ       1000     6.510    5.208          15.624       17.856
AR       1000     4.032    5.824          21.056       21.280
CA       1000     4.200    3.360          10.920       10.680

In [25]:
# column 추가하는 방법 
df["test"] = "test"
df

        total  speeding  alcohol  not_distracted  no_previous  test
abbrev
AL       1000     7.332    5.640          18.048       15.040  test
AK       1000     7.421    4.525          16.290       17.014  test
AZ       1000     6.510    5.208          15.624       17.856  test
AR       1000     4.032    5.824          21.056       21.280  test
CA       1000     4.200    3.360          10.920       10.680  test

In [26]:
# column 삭제 - 막 추가했던 test column을 삭제해 봅시다
# 삭제할 때는 drop이라는 명령어를 사용합니다. 

df.drop("test", axis=1, inplace=False)

# 여기서 axis = 0은 index를 의미하며, 
# axis=1은 column을 의미합니다.

        total  speeding  alcohol  not_distracted  no_previous
abbrev
AL       1000     7.332    5.640          18.048       15.040
AK       1000     7.421    4.525          16.290       17.014
AZ       1000     6.510    5.208          15.624       17.856
AR       1000     4.032    5.824          21.056       21.280
CA       1000     4.200    3.360          10.920       10.680

In [27]:
# 현재 index에 들어있는 abbrev은 미국의 주의 약어 입니다. 
# abbrev은 의미가 막 와닿지 않죠? index의 명을 한번 바꿔봅시다. 

df.index.name ="US local name"
df

               total  speeding  alcohol  not_distracted  no_previous  test
US local name
AL              1000     7.332    5.640          18.048       15.040  test
AK              1000     7.421    4.525          16.290       17.014  test
AZ              1000     6.510    5.208          15.624       17.856  test
AR              1000     4.032    5.824          21.056       21.280  test
CA              1000     4.200    3.360          10.920       10.680  test

In [28]:
# 이제는 갑자기 인덱스를 total로 바꿔보고 싶습니다. 
# 그럼 set_index()를 사용하면 되겠다? 라는 생각이 들죠?
# 바로 코드를 적어봅시다. 

df.set_index("total")

       speeding  alcohol  not_distracted  no_previous  test
total
1000      7.332    5.640          18.048       15.040  test
1000      7.421    4.525          16.290       17.014  test
1000      6.510    5.208          15.624       17.856  test
1000      4.032    5.824          21.056       21.280  test
1000      4.200    3.360          10.920       10.680  test

In [29]:
# 인덱스 값 변경 복습 
# 일단, 원하는대로 index는 변경이 되었는데, us local name이 없어졌습니다. 
# 이 문제를 어떻게 해결할 수 있을까요?

df

# 일단, inplace=False를 하지 않았기 때문에 데이터는 살아있습니다.

               total  speeding  alcohol  not_distracted  no_previous  test
US local name
AL              1000     7.332    5.640          18.048       15.040  test
AK              1000     7.421    4.525          16.290       17.014  test
AZ              1000     6.510    5.208          15.624       17.856  test
AR              1000     4.032    5.824          21.056       21.280  test
CA              1000     4.200    3.360          10.920       10.680  test

In [30]:
# US local name를 column으로 지정하자
# index는 column이 아닙니다. 
# 이 개념이 이해가 되지 않는다면 1장에서 df 설명을 다 읽고 오시고
# 그래도 모르시겠다면, 구글링을 반드시 이해하고 넘어가야 하는 부분입니다. 

df["US local name"] = df.index
df

               total  speeding  alcohol  ...  no_previous  test US local name
US local name                            ...
AL              1000     7.332    5.640  ...       15.040  test            AL
AK              1000     7.421    4.525  ...       17.014  test            AK
AZ              1000     6.510    5.208  ...       17.856  test            AZ
AR              1000     4.032    5.824  ...       21.280  test            AR
CA              1000     4.200    3.360  ...       10.680  test            CA

[5 rows x 7 columns]

In [31]:
# 이렇게 처리한 다음 set_index를 해주면 됩니다. 
df.set_index("total", inplace=True)
df

       speeding  alcohol  not_distracted  no_previous  test US local name
total
1000      7.332    5.640          18.048       15.040  test            AL
1000      7.421    4.525          16.290       17.014  test            AK
1000      6.510    5.208          15.624       17.856  test            AZ
1000      4.032    5.824          21.056       21.280  test            AR
1000      4.200    3.360          10.920       10.680  test            CA

##### 자! 이번에는 테스트를 진행해보겠습니다. 
##### column은 not_distracted에서 test까지
##### row는 1~3까지를 가져와보세요

In [32]:
# 해보셨나요?

df.iloc[1:3, 2:5]

       not_distracted  no_previous  test
total
1000           16.290       17.014  test
1000           15.624       17.856  test

In [33]:
# row 역순으로 출력하는 방법

df.loc[::-1].head()

       speeding  alcohol  not_distracted  no_previous  test US local name
total
1000      4.200    3.360          10.920       10.680  test            CA
1000      4.032    5.824          21.056       21.280  test            AR
1000      6.510    5.208          15.624       17.856  test            AZ
1000      7.421    4.525          16.290       17.014  test            AK
1000      7.332    5.640          18.048       15.040  test            AL

In [34]:
# cloumn 역순으로 출력하는 방법 

df.loc[:, ::-1].head()

      US local name  test  no_previous  not_distracted  alcohol  speeding
total
1000             AL  test       15.040          18.048    5.640     7.332
1000             AK  test       17.014          16.290    4.525     7.421
1000             AZ  test       17.856          15.624    5.208     6.510
1000             AR  test       21.280          21.056    5.824     4.032
1000             CA  test       10.680          10.920    3.360     4.200

In [35]:
# 우리는 지금 데이터를 슬라이싱하여 우리가 필요한 정보는 얻을 수 있도록 연습하고 있다.
# 가끔 실습을 하다보면 랜덤하게 데이터를 선택해야할 때가 있는데 어떻게 해야할 수 있을까?
# 조금 더 편하게 실험을 하기 위해 우리는 df를 최초의 데이터로 가져오도록 하겠습니다. 

url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/car_crashes.csv"
df = pd.read_csv(url)
len(df)

51

DataFrame을 두 부분으로 분할하여 행의 75 %를 하나의 DataFrame에 무작위로 할당하고  
나머지 25 %를 두 번째 DataFrame에 할당하려고한다고 가정 해 보겠습니다.

예를 들어, 51 개의 행이있는 영화 등급의 DataFrame이 있습니다.

이 sample()메서드를 사용하여 행의 75 %를 무작위로 선택하고 "df1"에 할당 할 수 있습니다.

In [36]:
df1 = df.sample(frac=0.75, random_state=1234)
len(df1)

38

그런 다음 drop()메서드를 사용하여 "df1"에있는 모든 행을 삭제하고 나머지 행을 "df2"에 할당 할 수 있습니다.

In [37]:
df2 = df.drop(df1.index)
len(df2)

13

In [38]:
# 혹시 몰라 len를 이용하여 잘 나누어졌는지 확인합니다. 
len(df1)+len(df2)

51

### 2-6) 필터를 통한 슬라이싱

In [39]:
# 지금부터는 필터를 통한 슬라이싱을 진행하고자 합니다. 
# 대신 df를 아래와 한 반의 수학, 영어, 취미를 담고 있는 데이터를 이용해보겠습니다.

In [40]:
df_info = pd.DataFrame(
    {
        "student_number" : ["1", "2", "3", "4", "5", "6", "7", "8"],
        "math_score": ["89", "90", "78", "99", "89", "90", "78", "100"],
        "english_score": ["90", "95", "70", "87", "89", "90", "78", "99"],
        "code_score": ["90", "95", "70", "87", "89", "90", "78", "-"],
        "hobby": ["soccer", "moive", "moive", "swim", "soccer", "moive", "moive", "swim"],
        "home_address": ["B", "B", "A", "C", "B", "B", "A", "C"],
    }
)
df_info = df_info.set_index("student_number")
df_info

               math_score english_score code_score   hobby home_address
student_number
1                      89            90         90  soccer            B
2                      90            95         95   moive            B
3                      78            70         70   moive            A
4                      99            87         87    swim            C
5                      89            89         89  soccer            B
6                      90            90         90   moive            B
7                      78            78         78   moive            A
8                     100            99          -    swim            C

In [41]:
# 자! 그럼 취미가 축구인 사람만 남겨볼게요

df_soccer = df_info["hobby"] == "soccer"
df_info.loc[df_soccer]

               math_score english_score code_score   hobby home_address
student_number
1                      89            90         90  soccer            B
5                      89            89         89  soccer            B

In [42]:
# 지금까지 배운 방법은 방법1이였습니다. 
# 이번에는 isin 명령어를 사용하여 간결하게 출력해보겠습니다. 

df_info[df_info.hobby.isin(["soccer"])]

# 별도의 변수 저장 없이 바로 이렇게 뽑아 낼 수 있습니다.

               math_score english_score code_score   hobby home_address
student_number
1                      89            90         90  soccer            B
5                      89            89         89  soccer            B

In [43]:
# 그럼 축구를 제외한 나머지를 출력해보겠습니다. 

df_info[~df_info.hobby.isin(["soccer"])]

# ~ 기호로 바로 축구를 제외한 나머지를 출력할 수 있습니다. 
# 매우 유용한 기호라고 생각합니다! 자주 애용중이라는...ㅎ

               math_score english_score code_score  hobby home_address
student_number
2                      90            95         95  moive            B
3                      78            70         70  moive            A
4                      99            87         87   swim            C
6                      90            90         90  moive            B
7                      78            78         78  moive            A
8                     100            99          -   swim            C

In [44]:
# 이번에는 nlargest라는 명령을 이용해보고자 합니다. 
# 일반적으로 df에서 가장 많은 데이터가 무엇인지를 확인하기 위해 value_counts()라는 명령어를 사용합니다. 

counts = df_info.home_address.value_counts()
counts

B    4
C    2
A    2
Name: home_address, dtype: int64

In [45]:
# nlargest를 사용하도 바로 이렇게 출력을 할 수 있습니다. 

counts.nlargest(3)

B    4
C    2
A    2
Name: home_address, dtype: int64

In [46]:
# nlargest를 이용하여 isin을 혼용하여 사용할 수 있습니다. 

df_info[df_info.home_address.isin(counts.nlargest(1).index)]

               math_score english_score code_score   hobby home_address
student_number
1                      89            90         90  soccer            B
2                      90            95         95   moive            B
5                      89            89         89  soccer            B
6                      90            90         90   moive            B

## 3. EDA

### 3-1) str을 number로 전환하기

In [47]:
# df는 str(문자), int(정수), float(소수) 등으로 구성되어 있다. 
# 이제 EDA를 배울 것인데, 일반적으로 df를 외부에서 불러오게 되면, 숫자처럼 보여도 str인 겨우가 많다. 
# EDA를 진행하기 위해 str형인 숫자들을 정수나, 소수형으로 변경해야 한다. 
# 데이터유형 슬라이싱은 이러한 전처리 과정을 용이하게 해준다.

In [48]:
df_info.dtypes

math_score       object
english_score    object
code_score       object
hobby            object
home_address     object
dtype: object

In [49]:
df_info.astype({'math_score':'float', 'english_score':'float'}).dtypes

math_score       float64
english_score    float64
code_score        object
hobby             object
home_address      object
dtype: object

In [50]:
# to_numeric()세 번째 열 에서 함수를 사용하여 잘못된 입력을 NaN값 으로 변환하도록 지시 할 수 있습니다.

pd.to_numeric(df_info.code_score, errors='coerce')

student_number
1    90.0
2    95.0
3    70.0
4    87.0
5    89.0
6    90.0
7    78.0
8     NaN
Name: code_score, dtype: float64

In [51]:
# NaN값이 실제로 0을 나타내는 것을 알고 있다면 다음 fillna()메서드를 사용하여 값을 0으로 채울 수 있습니다 .

pd.to_numeric(df_info.code_score, errors='coerce').fillna(0)

student_number
1    90.0
2    95.0
3    70.0
4    87.0
5    89.0
6    90.0
7    78.0
8     0.0
Name: code_score, dtype: float64

In [59]:
# 이제 이 모든 과정을 한번에 처리할 수 있도록 함수를 적어보자 
# 숫자처럼 보이는데 dtype에 ,가 포함되어 있는경우, 아래 코드를 이요하면 된다. 
# toInt 함수는 콤마가 있는 경우는 콤마를 제거하고 콤마가 없는 경우, 그대로 데이터를 사용한다. 
# 결측치를 처리할때는 처리할 범위를 별도로 지정하고 데이터처리를 진행하여야 한다. 

# 방법 1
df_info1 = df_info.iloc[0:, 0:2]
df_info1 = df_info1.apply(pd.to_numeric, errors='coerce').fillna(0)
df_info1.dtypes

# 방법2
# def toInt(string):
#   try: 
#     return int(string.replace(',', ''))
#   except:
#     return string

# # 
# for y in df_info:
#   df_info['{}'.format(y)] = df_info['{}'.format(y)].apply(toInt)

# print(df_info)
# print(df_info.dtypes)

math_score       int64
english_score    int64
dtype: object

지금까지 pandas 기초문법에 대해서 알아보았습니다.  

그 외 필요하신 정보는 공식문서를 참조부탁드리며, 기타 참조하실 만한 자료를 하단 링크로 전달 드립니다.  
 https://nbviewer.jupyter.org/github/justmarkham/pandas-videos/blob/master/top_25_pandas_tricks.ipynb#Bonus:-Profile-a-DataFrame

시각화 관련된 자료는 필요하시다면 추가적으로 업로드 하도록 하겠습니다. 
지금까지 업로드된 자료들만 충분히 숙지하시더라도 수업을 따라가는데는 부트캠프 등 수업을 따라가는데  무리가 없었습니다. 여러분께서 재미있게 코딩하시고 부족한 부분이나, 틀린 부분은 댓글 부탁드립니다. ^^